app/Http/Controllers/PlaceController.php

select * from `types`
---
    public function showForm()
    {
        $types = Type::all();

select `places`.*, `types`.`name` as `type_name` from `places` inner join `types` on `places`.`type` = `types`.`id`
---
    public function show() {
        $places = Place::join('types', 'places.type', '=', 'types.id')
            ->select('places.*', 'types.name as type_name')->get();